---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.WallTopExtensionDistParam
source: html/df3b7749-3528-7fc8-2e5f-f7578ae25233.htm
---
# Autodesk.Revit.DB.ParameterTypeId.WallTopExtensionDistParam Property

"Top Extension Distance"

## Syntax (C#)
```csharp
public static ForgeTypeId WallTopExtensionDistParam { get; }
```